# essential tooling
brew "asdf"
brew "jq"
brew "coreutils"
brew "findutils"
brew "colordiff"
brew "p7zip"
brew "docker-compose"

# proper terminal
cask "iterm2"
brew "zsh-history-substring-search" 
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions" 
brew "zsh-history-substring-search-up"

# kubernetes
cask "google-cloud-sdk"
brew "kubectl"
brew "fluxctl"
brew "awscli"
brew "k9s"
brew "krew"

# apps
cask "slack"
cask "visual-studio-code" 
cask "1password"
cask "alfred" 
cask "docker"

# general
cask "firefox" 
cask "spotify" 
cask "signal" 
cask "whatsapp"